GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.inc
// Register: APMSTART2
#define APMSTART2 APMSTART2
APMSTART2                                equ 01C9h

// Register: APMSTART2L
#define APMSTART2L APMSTART2L
APMSTART2L                               equ 01C9h
// bitfield definitions
APMSTART2L_START2_POSN                   equ 0000h
APMSTART2L_START2_POSITION               equ 0000h
APMSTART2L_START2_SIZE                   equ 0008h
APMSTART2L_START2_LENGTH                 equ 0008h
APMSTART2L_START2_MASK                   equ 00FFh

// Register: APMSTART2H
#define APMSTART2H APMSTART2H
APMSTART2H                               equ 01CAh
// bitfield definitions
APMSTART2H_START2_POSN                   equ 0000h
APMSTART2H_START2_POSITION               equ 0000h
APMSTART2H_START2_SIZE                   equ 0008h
APMSTART2H_START2_LENGTH                 equ 0008h
APMSTART2H_START2_MASK                   equ 00FFh

// Register: APMSTART2U
#define APMSTART2U APMSTART2U
APMSTART2U                               equ 01CBh
// bitfield definitions
APMSTART2U_START2_POSN                   equ 0000h
APMSTART2U_START2_POSITION               equ 0000h
APMSTART2U_START2_SIZE                   equ 0008h
APMSTART2U_START2_LENGTH                 equ 0008h
APMSTART2U_START2_MASK                   equ 00FFh

// Register: APMPERS2
#define APMPERS2 APMPERS2
APMPERS2                                 equ 01CCh

// Register: APMPERS2L
#define APMPERS2L APMPERS2L
APMPERS2L                                equ 01CCh
// bitfield definitions
APMPERS2L_APMPERS2_POSN                  equ 0000h
APMPERS2L_APMPERS2_POSITION              equ 0000h
APMPERS2L_APMPERS2_SIZE                  equ 0008h
APMPERS2L_APMPERS2_LENGTH                equ 0008h
APMPERS2L_APMPERS2_MASK                  equ 00FFh
APMPERS2L_BG_POSN                        equ 0002h
APMPERS2L_BG_POSITION                    equ 0002h
APMPERS2L_BG_SIZE                        equ 0001h
APMPERS2L_BG_LENGTH                      equ 0001h
APMPERS2L_BG_MASK                        equ 0004h
APMPERS2L_FVR1_POSN                      equ 0003h
APMPERS2L_FVR1_POSITION                  equ 0003h
APMPERS2L_FVR1_SIZE                      equ 0001h
APMPERS2L_FVR1_LENGTH                    equ 0001h
APMPERS2L_FVR1_MASK                      equ 0008h
APMPERS2L_FVR2_POSN                      equ 0004h
APMPERS2L_FVR2_POSITION                  equ 0004h
APMPERS2L_FVR2_SIZE                      equ 0001h
APMPERS2L_FVR2_LENGTH                    equ 0001h
APMPERS2L_FVR2_MASK                      equ 0010h
APMPERS2L_ADCD_POSN                      equ 0005h
APMPERS2L_ADCD_POSITION                  equ 0005h
APMPERS2L_ADCD_SIZE                      equ 0001h
APMPERS2L_ADCD_LENGTH                    equ 0001h
APMPERS2L_ADCD_MASK                      equ 0020h
APMPERS2L_ADCA_POSN                      equ 0006h
APMPERS2L_ADCA_POSITION                  equ 0006h
APMPERS2L_ADCA_SIZE                      equ 0001h
APMPERS2L_ADCA_LENGTH                    equ 0001h
APMPERS2L_ADCA_MASK                      equ 0040h
APMPERS2L_TEMP_POSN                      equ 0007h
APMPERS2L_TEMP_POSITION                  equ 0007h
APMPERS2L_TEMP_SIZE                      equ 0001h
APMPERS2L_TEMP_LENGTH                    equ 0001h
APMPERS2L_TEMP_MASK                      equ 0080h
APMPERS2L_APMPERS2_2_POSN                equ 0002h
APMPERS2L_APMPERS2_2_POSITION            equ 0002h
APMPERS2L_APMPERS2_2_SIZE                equ 0001h
APMPERS2L_APMPERS2_2_LENGTH              equ 0001h
APMPERS2L_APMPERS2_2_MASK                equ 0004h
APMPERS2L_APMPERS2_3_POSN                equ 0003h
APMPERS2L_APMPERS2_3_POSITION            equ 0003h
APMPERS2L_APMPERS2_3_SIZE                equ 0001h
APMPERS2L_APMPERS2_3_LENGTH              equ 0001h
APMPERS2L_APMPERS2_3_MASK                equ 0008h
APMPERS2L_APMPERS2_4_POSN                equ 0004h
APMPERS2L_APMPERS2_4_POSITION            equ 0004h
APMPERS2L_APMPERS2_4_SIZE                equ 0001h
APMPERS2L_APMPERS2_4_LENGTH              equ 0001h
APMPERS2L_APMPERS2_4_MASK                equ 0010h
APMPERS2L_APMPERS2_5_POSN                equ 0005h
APMPERS2L_APMPERS2_5_POSITION            equ 0005h
APMPERS2L_APMPERS2_5_SIZE                equ 0001h
APMPERS2L_APMPERS2_5_LENGTH              equ 0001h
APMPERS2L_APMPERS2_5_MASK                equ 0020h
APMPERS2L_APMPERS2_6_POSN                equ 0006h
APMPERS2L_APMPERS2_6_POSITION            equ 0006h
APMPERS2L_APMPERS2_6_SIZE                equ 0001h
APMPERS2L_APMPERS2_6_LENGTH              equ 0001h
APMPERS2L_APMPERS2_6_MASK                equ 0040h
APMPERS2L_APMPERS2_7_POSN                equ 0007h
APMPERS2L_APMPERS2_7_POSITION            equ 0007h
APMPERS2L_APMPERS2_7_SIZE                equ 0001h
APMPERS2L_APMPERS2_7_LENGTH              equ 0001h
APMPERS2L_APMPERS2_7_MASK                equ 0080h

// Register: APMPERS2H
#define APMPERS2H APMPERS2H
APMPERS2H                                equ 01CDh
// bitfield definitions
APMPERS2H_APMPERS2_POSN                  equ 0000h
APMPERS2H_APMPERS2_POSITION              equ 0000h
APMPERS2H_APMPERS2_SIZE                  equ 0008h
APMPERS2H_APMPERS2_LENGTH                equ 0008h
APMPERS2H_APMPERS2_MASK                  equ 00FFh
APMPERS2H_OPA1_POSN                      equ 0000h
APMPERS2H_OPA1_POSITION                  equ 0000h
APMPERS2H_OPA1_SIZE                      equ 0001h
APMPERS2H_OPA1_LENGTH                    equ 0001h
APMPERS2H_OPA1_MASK                      equ 0001h
APMPERS2H_OPA2_POSN                      equ 0001h
APMPERS2H_OPA2_POSITION                  equ 0001h
APMPERS2H_OPA2_SIZE                      equ 0001h
APMPERS2H_OPA2_LENGTH                    equ 0001h
APMPERS2H_OPA2_MASK                      equ 0002h
APMPERS2H_DAC1_POSN                      equ 0002h
APMPERS2H_DAC1_POSITION                  equ 0002h
APMPERS2H_DAC1_SIZE                      equ 0001h
APMPERS2H_DAC1_LENGTH                    equ 0001h
APMPERS2H_DAC1_MASK                      equ 0004h
APMPERS2H_DAC2_POSN                      equ 0003h
APMPERS2H_DAC2_POSITION                  equ 0003h
APMPERS2H_DAC2_SIZE                      equ 0001h
APMPERS2H_DAC2_LENGTH                    equ 0001h
APMPERS2H_DAC2_MASK                      equ 0008h
APMPERS2H_DAC3_POSN                      equ 0004h
APMPERS2H_DAC3_POSITION                  equ 0004h
APMPERS2H_DAC3_SIZE                      equ 0001h
APMPERS2H_DAC3_LENGTH                    equ 0001h
APMPERS2H_DAC3_MASK                      equ 0010h
APMPERS2H_CMP1_POSN                      equ 0005h
APMPERS2H_CMP1_POSITION                  equ 0005h
APMPERS2H_CMP1_SIZE                      equ 0001h
APMPERS2H_CMP1_LENGTH                    equ 0001h
APMPERS2H_CMP1_MASK                      equ 0020h
APMPERS2H_CMP2_POSN                      equ 0006h
APMPERS2H_CMP2_POSITION                  equ 0006h
APMPERS2H_CMP2_SIZE                      equ 0001h
APMPERS2H_CMP2_LENGTH                    equ 0001h
APMPERS2H_CMP2_MASK                      equ 0040h
APMPERS2H_ZCD_POSN                       equ 0007h
APMPERS2H_ZCD_POSITION                   equ 0007h
APMPERS2H_ZCD_SIZE                       equ 0001h
APMPERS2H_ZCD_LENGTH                     equ 0001h
APMPERS2H_ZCD_MASK                       equ 0080h
APMPERS2H_APMPERS2_8_POSN                equ 0000h
APMPERS2H_APMPERS2_8_POSITION            equ 0000h
APMPERS2H_APMPERS2_8_SIZE                equ 0001h
APMPERS2H_APMPERS2_8_LENGTH              equ 0001h
APMPERS2H_APMPERS2_8_MASK                equ 0001h
APMPERS2H_APMPERS2_9_POSN                equ 0001h
APMPERS2H_APMPERS2_9_POSITION            equ 0001h
APMPERS2H_APMPERS2_9_SIZE                equ 0001h
APMPERS2H_APMPERS2_9_LENGTH              equ 0001h
APMPERS2H_APMPERS2_9_MASK                equ 0002h
APMPERS2H_APMPERS2_10_POSN               equ 0002h
APMPERS2H_APMPERS2_10_POSITION           equ 0002h
APMPERS2H_APMPERS2_10_SIZE               equ 0001h
APMPERS2H_APMPERS2_10_LENGTH             equ 0001h
APMPERS2H_APMPERS2_10_MASK               equ 0004h
APMPERS2H_APMPERS2_11_POSN               equ 0003h
APMPERS2H_APMPERS2_11_POSITION           equ 0003h
APMPERS2H_APMPERS2_11_SIZE               equ 0001h
APMPERS2H_APMPERS2_11_LENGTH             equ 0001h
APMPERS2H_APMPERS2_11_MASK               equ 0008h
APMPERS2H_APMPERS2_12_POSN               equ 0004h
APMPERS2H_APMPERS2_12_POSITION           equ 0004h
APMPERS2H_APMPERS2_12_SIZE               equ 0001h
APMPERS2H_APMPERS2_12_LENGTH             equ 0001h
APMPERS2H_APMPERS2_12_MASK               equ 0010h
APMPERS2H_APMPERS2_13_POSN               equ 0005h
APMPERS2H_APMPERS2_13_POSITION           equ 0005h
APMPERS2H_APMPERS2_13_SIZE               equ 0001h
APMPERS2H_APMPERS2_13_LENGTH             equ 0001h
APMPERS2H_APMPERS2_13_MASK               equ 0020h
APMPERS2H_APMPERS2_14_POSN               equ 0006h
APMPERS2H_APMPERS2_14_POSITION           equ 0006h
APMPERS2H_APMPERS2_14_SIZE               equ 0001h
APMPERS2H_APMPERS2_14_LENGTH             equ 0001h
APMPERS2H_APMPERS2_14_MASK               equ 0040h
APMPERS2H_APMPERS2_15_POSN               equ 0007h
APMPERS2H_APMPERS2_15_POSITION           equ 0007h
APMPERS2H_APMPERS2_15_SIZE               equ 0001h
APMPERS2H_APMPERS2_15_LENGTH             equ 0001h
APMPERS2H_APMPERS2_15_MASK               equ 0080h

// Register: APMEND1
#define APMEND1 APMEND1
APMEND1                                  equ 01CEh

