GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.inc
// Register: CRCCON1
#define CRCCON1 CRCCON1
CRCCON1                                  equ 0357h
// bitfield definitions
CRCCON1_PLEN_POSN                        equ 0000h
CRCCON1_PLEN_POSITION                    equ 0000h
CRCCON1_PLEN_SIZE                        equ 0005h
CRCCON1_PLEN_LENGTH                      equ 0005h
CRCCON1_PLEN_MASK                        equ 001Fh
CRCCON1_PLEN0_POSN                       equ 0000h
CRCCON1_PLEN0_POSITION                   equ 0000h
CRCCON1_PLEN0_SIZE                       equ 0001h
CRCCON1_PLEN0_LENGTH                     equ 0001h
CRCCON1_PLEN0_MASK                       equ 0001h
CRCCON1_PLEN1_POSN                       equ 0001h
CRCCON1_PLEN1_POSITION                   equ 0001h
CRCCON1_PLEN1_SIZE                       equ 0001h
CRCCON1_PLEN1_LENGTH                     equ 0001h
CRCCON1_PLEN1_MASK                       equ 0002h
CRCCON1_PLEN2_POSN                       equ 0002h
CRCCON1_PLEN2_POSITION                   equ 0002h
CRCCON1_PLEN2_SIZE                       equ 0001h
CRCCON1_PLEN2_LENGTH                     equ 0001h
CRCCON1_PLEN2_MASK                       equ 0004h
CRCCON1_PLEN3_POSN                       equ 0003h
CRCCON1_PLEN3_POSITION                   equ 0003h
CRCCON1_PLEN3_SIZE                       equ 0001h
CRCCON1_PLEN3_LENGTH                     equ 0001h
CRCCON1_PLEN3_MASK                       equ 0008h
CRCCON1_PLEN4_POSN                       equ 0004h
CRCCON1_PLEN4_POSITION                   equ 0004h
CRCCON1_PLEN4_SIZE                       equ 0001h
CRCCON1_PLEN4_LENGTH                     equ 0001h
CRCCON1_PLEN4_MASK                       equ 0010h

// Register: CRCCON2
#define CRCCON2 CRCCON2
CRCCON2                                  equ 0358h
// bitfield definitions
CRCCON2_DLEN_POSN                        equ 0000h
CRCCON2_DLEN_POSITION                    equ 0000h
CRCCON2_DLEN_SIZE                        equ 0005h
CRCCON2_DLEN_LENGTH                      equ 0005h
CRCCON2_DLEN_MASK                        equ 001Fh
CRCCON2_DLEN0_POSN                       equ 0000h
CRCCON2_DLEN0_POSITION                   equ 0000h
CRCCON2_DLEN0_SIZE                       equ 0001h
CRCCON2_DLEN0_LENGTH                     equ 0001h
CRCCON2_DLEN0_MASK                       equ 0001h
CRCCON2_DLEN1_POSN                       equ 0001h
CRCCON2_DLEN1_POSITION                   equ 0001h
CRCCON2_DLEN1_SIZE                       equ 0001h
CRCCON2_DLEN1_LENGTH                     equ 0001h
CRCCON2_DLEN1_MASK                       equ 0002h
CRCCON2_DLEN2_POSN                       equ 0002h
CRCCON2_DLEN2_POSITION                   equ 0002h
CRCCON2_DLEN2_SIZE                       equ 0001h
CRCCON2_DLEN2_LENGTH                     equ 0001h
CRCCON2_DLEN2_MASK                       equ 0004h
CRCCON2_DLEN3_POSN                       equ 0003h
CRCCON2_DLEN3_POSITION                   equ 0003h
CRCCON2_DLEN3_SIZE                       equ 0001h
CRCCON2_DLEN3_LENGTH                     equ 0001h
CRCCON2_DLEN3_MASK                       equ 0008h
CRCCON2_DLEN4_POSN                       equ 0004h
CRCCON2_DLEN4_POSITION                   equ 0004h
CRCCON2_DLEN4_SIZE                       equ 0001h
CRCCON2_DLEN4_LENGTH                     equ 0001h
CRCCON2_DLEN4_MASK                       equ 0010h

// Register: SCANLADR
#define SCANLADR SCANLADR
SCANLADR                                 equ 035Ah

// Register: SCANLADRL
#define SCANLADRL SCANLADRL
SCANLADRL                                equ 035Ah
// bitfield definitions
SCANLADRL_LADR_POSN                      equ 0000h
SCANLADRL_LADR_POSITION                  equ 0000h
SCANLADRL_LADR_SIZE                      equ 0008h
SCANLADRL_LADR_LENGTH                    equ 0008h
SCANLADRL_LADR_MASK                      equ 00FFh
SCANLADRL_LADR0_POSN                     equ 0000h
SCANLADRL_LADR0_POSITION                 equ 0000h
SCANLADRL_LADR0_SIZE                     equ 0001h
SCANLADRL_LADR0_LENGTH                   equ 0001h
SCANLADRL_LADR0_MASK                     equ 0001h
SCANLADRL_LADR1_POSN                     equ 0001h
SCANLADRL_LADR1_POSITION                 equ 0001h
SCANLADRL_LADR1_SIZE                     equ 0001h
SCANLADRL_LADR1_LENGTH                   equ 0001h
SCANLADRL_LADR1_MASK                     equ 0002h
SCANLADRL_LADR2_POSN                     equ 0002h
SCANLADRL_LADR2_POSITION                 equ 0002h
SCANLADRL_LADR2_SIZE                     equ 0001h
SCANLADRL_LADR2_LENGTH                   equ 0001h
SCANLADRL_LADR2_MASK                     equ 0004h
SCANLADRL_LADR3_POSN                     equ 0003h
SCANLADRL_LADR3_POSITION                 equ 0003h
SCANLADRL_LADR3_SIZE                     equ 0001h
SCANLADRL_LADR3_LENGTH                   equ 0001h
SCANLADRL_LADR3_MASK                     equ 0008h
SCANLADRL_LADR4_POSN                     equ 0004h
SCANLADRL_LADR4_POSITION                 equ 0004h
SCANLADRL_LADR4_SIZE                     equ 0001h
SCANLADRL_LADR4_LENGTH                   equ 0001h
SCANLADRL_LADR4_MASK                     equ 0010h
SCANLADRL_LADR5_POSN                     equ 0005h
SCANLADRL_LADR5_POSITION                 equ 0005h
SCANLADRL_LADR5_SIZE                     equ 0001h
SCANLADRL_LADR5_LENGTH                   equ 0001h
SCANLADRL_LADR5_MASK                     equ 0020h
SCANLADRL_LADR6_POSN                     equ 0006h
SCANLADRL_LADR6_POSITION                 equ 0006h
SCANLADRL_LADR6_SIZE                     equ 0001h
SCANLADRL_LADR6_LENGTH                   equ 0001h
SCANLADRL_LADR6_MASK                     equ 0040h
SCANLADRL_LADR7_POSN                     equ 0007h
SCANLADRL_LADR7_POSITION                 equ 0007h
SCANLADRL_LADR7_SIZE                     equ 0001h
SCANLADRL_LADR7_LENGTH                   equ 0001h
SCANLADRL_LADR7_MASK                     equ 0080h
SCANLADRL_SCANLADR_POSN                  equ 0000h
SCANLADRL_SCANLADR_POSITION              equ 0000h
SCANLADRL_SCANLADR_SIZE                  equ 0008h
SCANLADRL_SCANLADR_LENGTH                equ 0008h
SCANLADRL_SCANLADR_MASK                  equ 00FFh
SCANLADRL_SCANLADR0_POSN                 equ 0000h
SCANLADRL_SCANLADR0_POSITION             equ 0000h
SCANLADRL_SCANLADR0_SIZE                 equ 0001h
SCANLADRL_SCANLADR0_LENGTH               equ 0001h
SCANLADRL_SCANLADR0_MASK                 equ 0001h
SCANLADRL_SCANLADR1_POSN                 equ 0001h
SCANLADRL_SCANLADR1_POSITION             equ 0001h
SCANLADRL_SCANLADR1_SIZE                 equ 0001h
SCANLADRL_SCANLADR1_LENGTH               equ 0001h
SCANLADRL_SCANLADR1_MASK                 equ 0002h
SCANLADRL_SCANLADR2_POSN                 equ 0002h
SCANLADRL_SCANLADR2_POSITION             equ 0002h
SCANLADRL_SCANLADR2_SIZE                 equ 0001h
SCANLADRL_SCANLADR2_LENGTH               equ 0001h
SCANLADRL_SCANLADR2_MASK                 equ 0004h
SCANLADRL_SCANLADR3_POSN                 equ 0003h
SCANLADRL_SCANLADR3_POSITION             equ 0003h
SCANLADRL_SCANLADR3_SIZE                 equ 0001h
SCANLADRL_SCANLADR3_LENGTH               equ 0001h
SCANLADRL_SCANLADR3_MASK                 equ 0008h
SCANLADRL_SCANLADR4_POSN                 equ 0004h
SCANLADRL_SCANLADR4_POSITION             equ 0004h
SCANLADRL_SCANLADR4_SIZE                 equ 0001h
SCANLADRL_SCANLADR4_LENGTH               equ 0001h
SCANLADRL_SCANLADR4_MASK                 equ 0010h
SCANLADRL_SCANLADR5_POSN                 equ 0005h
SCANLADRL_SCANLADR5_POSITION             equ 0005h
SCANLADRL_SCANLADR5_SIZE                 equ 0001h
SCANLADRL_SCANLADR5_LENGTH               equ 0001h
SCANLADRL_SCANLADR5_MASK                 equ 0020h
SCANLADRL_SCANLADR6_POSN                 equ 0006h
SCANLADRL_SCANLADR6_POSITION             equ 0006h
SCANLADRL_SCANLADR6_SIZE                 equ 0001h
SCANLADRL_SCANLADR6_LENGTH               equ 0001h
SCANLADRL_SCANLADR6_MASK                 equ 0040h
SCANLADRL_SCANLADR7_POSN                 equ 0007h
SCANLADRL_SCANLADR7_POSITION             equ 0007h
SCANLADRL_SCANLADR7_SIZE                 equ 0001h
SCANLADRL_SCANLADR7_LENGTH               equ 0001h
SCANLADRL_SCANLADR7_MASK                 equ 0080h

// Register: SCANLADRH
#define SCANLADRH SCANLADRH
SCANLADRH                                equ 035Bh
// bitfield definitions
SCANLADRH_LADR_POSN                      equ 0000h
SCANLADRH_LADR_POSITION                  equ 0000h
SCANLADRH_LADR_SIZE                      equ 0008h
SCANLADRH_LADR_LENGTH                    equ 0008h
SCANLADRH_LADR_MASK                      equ 00FFh
SCANLADRH_LADR8_POSN                     equ 0000h
SCANLADRH_LADR8_POSITION                 equ 0000h
SCANLADRH_LADR8_SIZE                     equ 0001h
SCANLADRH_LADR8_LENGTH                   equ 0001h
SCANLADRH_LADR8_MASK                     equ 0001h
SCANLADRH_LADR9_POSN                     equ 0001h
SCANLADRH_LADR9_POSITION                 equ 0001h
SCANLADRH_LADR9_SIZE                     equ 0001h
SCANLADRH_LADR9_LENGTH                   equ 0001h
SCANLADRH_LADR9_MASK                     equ 0002h
SCANLADRH_LADR10_POSN                    equ 0002h
SCANLADRH_LADR10_POSITION                equ 0002h
SCANLADRH_LADR10_SIZE                    equ 0001h
SCANLADRH_LADR10_LENGTH                  equ 0001h
SCANLADRH_LADR10_MASK                    equ 0004h
SCANLADRH_LADR11_POSN                    equ 0003h
SCANLADRH_LADR11_POSITION                equ 0003h
SCANLADRH_LADR11_SIZE                    equ 0001h
SCANLADRH_LADR11_LENGTH                  equ 0001h
SCANLADRH_LADR11_MASK                    equ 0008h
SCANLADRH_LADR12_POSN                    equ 0004h
SCANLADRH_LADR12_POSITION                equ 0004h
SCANLADRH_LADR12_SIZE                    equ 0001h
SCANLADRH_LADR12_LENGTH                  equ 0001h
SCANLADRH_LADR12_MASK                    equ 0010h
SCANLADRH_LADR13_POSN                    equ 0005h
SCANLADRH_LADR13_POSITION                equ 0005h
SCANLADRH_LADR13_SIZE                    equ 0001h
SCANLADRH_LADR13_LENGTH                  equ 0001h
SCANLADRH_LADR13_MASK                    equ 0020h
SCANLADRH_LADR14_POSN                    equ 0006h
SCANLADRH_LADR14_POSITION                equ 0006h
SCANLADRH_LADR14_SIZE                    equ 0001h
SCANLADRH_LADR14_LENGTH                  equ 0001h
SCANLADRH_LADR14_MASK                    equ 0040h
SCANLADRH_LADR15_POSN                    equ 0007h
SCANLADRH_LADR15_POSITION                equ 0007h
SCANLADRH_LADR15_SIZE                    equ 0001h
SCANLADRH_LADR15_LENGTH                  equ 0001h
SCANLADRH_LADR15_MASK                    equ 0080h
SCANLADRH_SCANLADR_POSN                  equ 0000h
SCANLADRH_SCANLADR_POSITION              equ 0000h
SCANLADRH_SCANLADR_SIZE                  equ 0008h
SCANLADRH_SCANLADR_LENGTH                equ 0008h
SCANLADRH_SCANLADR_MASK                  equ 00FFh
SCANLADRH_SCANLADR8_POSN                 equ 0000h
SCANLADRH_SCANLADR8_POSITION             equ 0000h
SCANLADRH_SCANLADR8_SIZE                 equ 0001h
SCANLADRH_SCANLADR8_LENGTH               equ 0001h
SCANLADRH_SCANLADR8_MASK                 equ 0001h
SCANLADRH_SCANLADR9_POSN                 equ 0001h
SCANLADRH_SCANLADR9_POSITION             equ 0001h
SCANLADRH_SCANLADR9_SIZE                 equ 0001h
SCANLADRH_SCANLADR9_LENGTH               equ 0001h
SCANLADRH_SCANLADR9_MASK                 equ 0002h
SCANLADRH_SCANLADR10_POSN                equ 0002h
SCANLADRH_SCANLADR10_POSITION            equ 0002h
SCANLADRH_SCANLADR10_SIZE                equ 0001h
SCANLADRH_SCANLADR10_LENGTH              equ 0001h
SCANLADRH_SCANLADR10_MASK                equ 0004h
SCANLADRH_SCANLADR11_POSN                equ 0003h
SCANLADRH_SCANLADR11_POSITION            equ 0003h
SCANLADRH_SCANLADR11_SIZE                equ 0001h
SCANLADRH_SCANLADR11_LENGTH              equ 0001h
SCANLADRH_SCANLADR11_MASK                equ 0008h
SCANLADRH_SCANLADR12_POSN                equ 0004h
SCANLADRH_SCANLADR12_POSITION            equ 0004h
SCANLADRH_SCANLADR12_SIZE                equ 0001h
SCANLADRH_SCANLADR12_LENGTH              equ 0001h
SCANLADRH_SCANLADR12_MASK                equ 0010h
SCANLADRH_SCANLADR13_POSN                equ 0005h
SCANLADRH_SCANLADR13_POSITION            equ 0005h
SCANLADRH_SCANLADR13_SIZE                equ 0001h
SCANLADRH_SCANLADR13_LENGTH              equ 0001h
SCANLADRH_SCANLADR13_MASK                equ 0020h
SCANLADRH_SCANLADR14_POSN                equ 0006h
SCANLADRH_SCANLADR14_POSITION            equ 0006h
SCANLADRH_SCANLADR14_SIZE                equ 0001h
SCANLADRH_SCANLADR14_LENGTH              equ 0001h
SCANLADRH_SCANLADR14_MASK                equ 0040h
SCANLADRH_SCANLADR15_POSN                equ 0007h
SCANLADRH_SCANLADR15_POSITION            equ 0007h
SCANLADRH_SCANLADR15_SIZE                equ 0001h
SCANLADRH_SCANLADR15_LENGTH              equ 0001h
SCANLADRH_SCANLADR15_MASK                equ 0080h

// Register: SCANLADRU
#define SCANLADRU SCANLADRU
SCANLADRU                                equ 035Ch
// bitfield definitions
SCANLADRU_LADR_POSN                      equ 0000h
SCANLADRU_LADR_POSITION                  equ 0000h
SCANLADRU_LADR_SIZE                      equ 0006h
SCANLADRU_LADR_LENGTH                    equ 0006h
SCANLADRU_LADR_MASK                      equ 003Fh
SCANLADRU_LADR16_POSN                    equ 0000h
SCANLADRU_LADR16_POSITION                equ 0000h
SCANLADRU_LADR16_SIZE                    equ 0001h
SCANLADRU_LADR16_LENGTH                  equ 0001h
SCANLADRU_LADR16_MASK                    equ 0001h
SCANLADRU_LADR17_POSN                    equ 0001h
SCANLADRU_LADR17_POSITION                equ 0001h
SCANLADRU_LADR17_SIZE                    equ 0001h
SCANLADRU_LADR17_LENGTH                  equ 0001h
SCANLADRU_LADR17_MASK                    equ 0002h
SCANLADRU_LADR18_POSN                    equ 0002h
SCANLADRU_LADR18_POSITION                equ 0002h
SCANLADRU_LADR18_SIZE                    equ 0001h
SCANLADRU_LADR18_LENGTH                  equ 0001h
SCANLADRU_LADR18_MASK                    equ 0004h
SCANLADRU_LADR19_POSN                    equ 0003h
SCANLADRU_LADR19_POSITION                equ 0003h
SCANLADRU_LADR19_SIZE                    equ 0001h
SCANLADRU_LADR19_LENGTH                  equ 0001h
SCANLADRU_LADR19_MASK                    equ 0008h
SCANLADRU_LADR20_POSN                    equ 0004h
SCANLADRU_LADR20_POSITION                equ 0004h
SCANLADRU_LADR20_SIZE                    equ 0001h
SCANLADRU_LADR20_LENGTH                  equ 0001h
SCANLADRU_LADR20_MASK                    equ 0010h
SCANLADRU_LADR21_POSN                    equ 0005h
SCANLADRU_LADR21_POSITION                equ 0005h
SCANLADRU_LADR21_SIZE                    equ 0001h
SCANLADRU_LADR21_LENGTH                  equ 0001h
SCANLADRU_LADR21_MASK                    equ 0020h
SCANLADRU_SCANLADR_POSN                  equ 0000h
SCANLADRU_SCANLADR_POSITION              equ 0000h
SCANLADRU_SCANLADR_SIZE                  equ 0006h
SCANLADRU_SCANLADR_LENGTH                equ 0006h
SCANLADRU_SCANLADR_MASK                  equ 003Fh
SCANLADRU_SCANLADR16_POSN                equ 0000h
SCANLADRU_SCANLADR16_POSITION            equ 0000h
SCANLADRU_SCANLADR16_SIZE                equ 0001h
SCANLADRU_SCANLADR16_LENGTH              equ 0001h
SCANLADRU_SCANLADR16_MASK                equ 0001h
SCANLADRU_SCANLADR17_POSN                equ 0001h
SCANLADRU_SCANLADR17_POSITION            equ 0001h
SCANLADRU_SCANLADR17_SIZE                equ 0001h
SCANLADRU_SCANLADR17_LENGTH              equ 0001h
SCANLADRU_SCANLADR17_MASK                equ 0002h
SCANLADRU_SCANLADR18_POSN                equ 0002h
SCANLADRU_SCANLADR18_POSITION            equ 0002h
SCANLADRU_SCANLADR18_SIZE                equ 0001h
SCANLADRU_SCANLADR18_LENGTH              equ 0001h
SCANLADRU_SCANLADR18_MASK                equ 0004h
SCANLADRU_SCANLADR19_POSN                equ 0003h
SCANLADRU_SCANLADR19_POSITION            equ 0003h
SCANLADRU_SCANLADR19_SIZE                equ 0001h
SCANLADRU_SCANLADR19_LENGTH              equ 0001h
SCANLADRU_SCANLADR19_MASK                equ 0008h
SCANLADRU_SCANLADR20_POSN                equ 0004h
SCANLADRU_SCANLADR20_POSITION            equ 0004h
SCANLADRU_SCANLADR20_SIZE                equ 0001h
SCANLADRU_SCANLADR20_LENGTH              equ 0001h
SCANLADRU_SCANLADR20_MASK                equ 0010h
SCANLADRU_SCANLADR21_POSN                equ 0005h
SCANLADRU_SCANLADR21_POSITION            equ 0005h
SCANLADRU_SCANLADR21_SIZE                equ 0001h
SCANLADRU_SCANLADR21_LENGTH              equ 0001h
SCANLADRU_SCANLADR21_MASK                equ 0020h

