GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.inc
#define CGE2                             BANKMASK(ADCGE), 2, b
#define CH16AB                           BANKMASK(TUCHAIN), 0, b
#define CKE                              BANKMASK(SPI1CON1), 6, b
#define CKP                              BANKMASK(SPI1CON1), 5, b
#define CKPS3                            BANKMASK(T0CON1), 3, b
#define CKS0                             BANKMASK(NCO1CLK), 0, b
#define CKS1                             BANKMASK(NCO1CLK), 1, b
#define CKS2                             BANKMASK(NCO1CLK), 2, b
#define CKS3                             BANKMASK(NCO1CLK), 3, b
#define CKS4                             BANKMASK(NCO1CLK), 4, b
#define CLC1IE                           BANKMASK(PIE0), 5, a
#define CLC1IF                           BANKMASK(PIR0), 5, a
#define CLC1IP                           BANKMASK(IPR0), 5, a
#define CLC1MD                           BANKMASK(PMD4), 1, b
#define CLC1OUT                          BANKMASK(CLCDATA), 0, b
#define CLC2IE                           BANKMASK(PIE5), 5, a
#define CLC2IF                           BANKMASK(PIR5), 5, a
#define CLC2IP                           BANKMASK(IPR5), 5, a
#define CLC2MD                           BANKMASK(PMD4), 2, b
#define CLC2OUT                          BANKMASK(CLCDATA), 1, b
#define CLC3IE                           BANKMASK(PIE7), 5, a
#define CLC3IF                           BANKMASK(PIR7), 5, a
#define CLC3IP                           BANKMASK(IPR7), 5, a
#define CLC3MD                           BANKMASK(PMD4), 3, b
#define CLC3OUT                          BANKMASK(CLCDATA), 2, b
#define CLC4IE                           BANKMASK(PIE8), 5, a
#define CLC4IF                           BANKMASK(PIR8), 5, a
#define CLC4IP                           BANKMASK(IPR8), 5, a
#define CLC4MD                           BANKMASK(PMD4), 4, b
#define CLC4OUT                          BANKMASK(CLCDATA), 3, b
#define CLC5IE                           BANKMASK(PIE2), 1, a
#define CLC5IF                           BANKMASK(PIR2), 1, a
#define CLC5IP                           BANKMASK(IPR2), 1, a
#define CLC5MD                           BANKMASK(PMD5), 4, b
#define CLC5OUT                          BANKMASK(CLCDATA), 4, b
#define CLC6IE                           BANKMASK(PIE5), 1, a
#define CLC6IF                           BANKMASK(PIR5), 1, a
#define CLC6IP                           BANKMASK(IPR5), 1, a
#define CLC6MD                           BANKMASK(PMD5), 5, b
#define CLC6OUT                          BANKMASK(CLCDATA), 5, b
#define CLC7IE                           BANKMASK(PIE6), 1, a
#define CLC7IF                           BANKMASK(PIR6), 1, a
#define CLC7IP                           BANKMASK(IPR6), 1, a
#define CLC7MD                           BANKMASK(PMD5), 6, b
#define CLC7OUT                          BANKMASK(CLCDATA), 6, b
#define CLC8IE                           BANKMASK(PIE10), 1, a
#define CLC8IF                           BANKMASK(PIR10), 1, a
#define CLC8IP                           BANKMASK(IPR10), 1, a
#define CLC8MD                           BANKMASK(PMD5), 7, b
#define CLC8OUT                          BANKMASK(CLCDATA), 7, b
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0, b
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1, b
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2, b
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3, b
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4, b
#define CLCIN0PPS5                       BANKMASK(CLCIN0PPS), 5, b
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0, b
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1, b
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2, b
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3, b
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4, b
#define CLCIN1PPS5                       BANKMASK(CLCIN1PPS), 5, b
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0, b
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1, b
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2, b
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3, b
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4, b
#define CLCIN2PPS5                       BANKMASK(CLCIN2PPS), 5, b
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0, b
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1, b
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2, b
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3, b
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4, b
#define CLCIN3PPS5                       BANKMASK(CLCIN3PPS), 5, b
#define CLCIN4PPS0                       BANKMASK(CLCIN4PPS), 0, b
#define CLCIN4PPS1                       BANKMASK(CLCIN4PPS), 1, b
#define CLCIN4PPS2                       BANKMASK(CLCIN4PPS), 2, b
#define CLCIN4PPS3                       BANKMASK(CLCIN4PPS), 3, b
#define CLCIN4PPS4                       BANKMASK(CLCIN4PPS), 4, b
#define CLCIN4PPS5                       BANKMASK(CLCIN4PPS), 5, b
#define CLCIN5PPS0                       BANKMASK(CLCIN5PPS), 0, b
#define CLCIN5PPS1                       BANKMASK(CLCIN5PPS), 1, b
#define CLCIN5PPS2                       BANKMASK(CLCIN5PPS), 2, b
#define CLCIN5PPS3                       BANKMASK(CLCIN5PPS), 3, b
#define CLCIN5PPS4                       BANKMASK(CLCIN5PPS), 4, b
#define CLCIN5PPS5                       BANKMASK(CLCIN5PPS), 5, b
#define CLCIN6PPS0                       BANKMASK(CLCIN6PPS), 0, b
#define CLCIN6PPS1                       BANKMASK(CLCIN6PPS), 1, b
#define CLCIN6PPS2                       BANKMASK(CLCIN6PPS), 2, b
#define CLCIN6PPS3                       BANKMASK(CLCIN6PPS), 3, b
#define CLCIN6PPS4                       BANKMASK(CLCIN6PPS), 4, b
#define CLCIN6PPS5                       BANKMASK(CLCIN6PPS), 5, b
#define CLCIN7PPS0                       BANKMASK(CLCIN7PPS), 0, b
#define CLCIN7PPS1                       BANKMASK(CLCIN7PPS), 1, b
#define CLCIN7PPS2                       BANKMASK(CLCIN7PPS), 2, b
#define CLCIN7PPS3                       BANKMASK(CLCIN7PPS), 3, b
#define CLCIN7PPS4                       BANKMASK(CLCIN7PPS), 4, b
#define CLCIN7PPS5                       BANKMASK(CLCIN7PPS), 5, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CLKSEL0                          BANKMASK(SPI1CLK), 0, b
#define CLKSEL1                          BANKMASK(SPI1CLK), 1, b
#define CLKSEL2                          BANKMASK(SPI1CLK), 2, b
#define CLKSEL3                          BANKMASK(SPI1CLK), 3, b
#define CLKSEL4                          BANKMASK(SPI1CLK), 4, b
#define CM1MD                            BANKMASK(PMD1), 7, b
#define CM2MD                            BANKMASK(PMD2), 0, b
#define CNT10                            BANKMASK(I2C1CNTH), 2, b
#define CNT11                            BANKMASK(I2C1CNTH), 3, b
#define CNT12                            BANKMASK(I2C1CNTH), 4, b
#define CNT13                            BANKMASK(I2C1CNTH), 5, b
#define CNT14                            BANKMASK(I2C1CNTH), 6, b
#define CNT15                            BANKMASK(I2C1CNTH), 7, b
#define CNT1IE                           BANKMASK(I2C1PIE), 7, b
#define CNT1IF                           BANKMASK(I2C1PIR), 7, b
#define CNT8                             BANKMASK(I2C1CNTH), 0, b
#define CNT9                             BANKMASK(I2C1CNTH), 1, b
#define CNTIE                            BANKMASK(I2C1PIE), 7, b
#define CNTIF                            BANKMASK(I2C1PIR), 7, b
#define CONT                             BANKMASK(ADCON0), 6, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CPRDY                            BANKMASK(ADCPCON), 0, b
#define CRCBUSY                          BANKMASK(CRCCON0), 5, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE0), 6, a
#define CRCIF                            BANKMASK(PIR0), 6, a
#define CRCIP                            BANKMASK(IPR0), 6, a
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSD                              BANKMASK(I2C1CON1), 0, b
#define CSEN                             BANKMASK(ADCON0), 5, b
#define CSTR                             BANKMASK(I2C1CON0), 4, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE0), 3, a
#define CSWIF                            BANKMASK(PIR0), 3, a
#define CSWIP                            BANKMASK(IPR0), 3, a
#define CTX0                             BANKMASK(ADCTX), 0, b
#define CTX1                             BANKMASK(ADCTX), 1, b
#define CTXSW                            BANKMASK(ADCTX), 7, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE6), 2, a
#define CWG1IF                           BANKMASK(PIR6), 2, a
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1INPPS0                       BANKMASK(CWG1PPS), 0, b
#define CWG1INPPS1                       BANKMASK(CWG1PPS), 1, b
#define CWG1INPPS2                       BANKMASK(CWG1PPS), 2, b
#define CWG1INPPS3                       BANKMASK(CWG1PPS), 3, b
#define CWG1INPPS4                       BANKMASK(CWG1PPS), 4, b
#define CWG1INPPS5                       BANKMASK(CWG1PPS), 5, b
#define CWG1IP                           BANKMASK(IPR6), 2, a
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1LSDB0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSDB1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD2), 6, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWGINPPS0                        BANKMASK(CWG1PPS), 0, b
#define CWGINPPS1                        BANKMASK(CWG1PPS), 1, b
#define CWGINPPS2                        BANKMASK(CWG1PPS), 2, b
#define CWGINPPS3                        BANKMASK(CWG1PPS), 3, b
#define CWGINPPS4                        BANKMASK(CWG1PPS), 4, b
#define CWGINPPS5                        BANKMASK(CWG1PPS), 5, b
#define D1S0                             BANKMASK(CLCnSEL0), 0, b
#define D1S1                             BANKMASK(CLCnSEL0), 1, b
#define D1S2                             BANKMASK(CLCnSEL0), 2, b
#define D1S3                             BANKMASK(CLCnSEL0), 3, b
#define D1S4                             BANKMASK(CLCnSEL0), 4, b
#define D1S5                             BANKMASK(CLCnSEL0), 5, b
#define D1S6                             BANKMASK(CLCnSEL0), 6, b
#define D2S0                             BANKMASK(CLCnSEL1), 0, b
#define D2S1                             BANKMASK(CLCnSEL1), 1, b
#define D2S2                             BANKMASK(CLCnSEL1), 2, b
#define D2S3                             BANKMASK(CLCnSEL1), 3, b
#define D2S4                             BANKMASK(CLCnSEL1), 4, b
#define D2S5                             BANKMASK(CLCnSEL1), 5, b
#define D2S6                             BANKMASK(CLCnSEL1), 6, b
#define D3S0                             BANKMASK(CLCnSEL2), 0, b
#define D3S1                             BANKMASK(CLCnSEL2), 1, b
#define D3S2                             BANKMASK(CLCnSEL2), 2, b
#define D3S3                             BANKMASK(CLCnSEL2), 3, b
#define D3S4                             BANKMASK(CLCnSEL2), 4, b
#define D3S5                             BANKMASK(CLCnSEL2), 5, b
#define D3S6                             BANKMASK(CLCnSEL2), 6, b
#define D4S0                             BANKMASK(CLCnSEL3), 0, b
#define D4S1                             BANKMASK(CLCnSEL3), 1, b
#define D4S2                             BANKMASK(CLCnSEL3), 2, b
#define D4S3                             BANKMASK(CLCnSEL3), 3, b
#define D4S4                             BANKMASK(CLCnSEL3), 4, b
#define D4S5                             BANKMASK(CLCnSEL3), 5, b
#define D4S6                             BANKMASK(CLCnSEL3), 6, b
#define DAC1EN                           BANKMASK(DAC1CON), 7, b
#define DAC1MD                           BANKMASK(PMD2), 2, b
#define DAC1PSS0                         BANKMASK(DAC1CON), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON), 3, b
#define DAC1R0                           BANKMASK(DAC1DATL), 0, b
#define DAC1R1                           BANKMASK(DAC1DATL), 1, b
#define DAC1R2                           BANKMASK(DAC1DATL), 2, b
#define DAC1R3                           BANKMASK(DAC1DATL), 3, b
#define DAC1R4                           BANKMASK(DAC1DATL), 4, b
#define DAC1R5                           BANKMASK(DAC1DATL), 5, b
#define DAC1R6                           BANKMASK(DAC1DATL), 6, b
#define DAC1R7                           BANKMASK(DAC1DATL), 7, b
#define DAC1R8                           BANKMASK(DAC1DATH), 0, b
#define DAC1R9                           BANKMASK(DAC1DATH), 1, b
#define DAC2EN                           BANKMASK(DAC2CON), 7, b
#define DAC2MD                           BANKMASK(PMD5), 1, b
#define DAC2PSS0                         BANKMASK(DAC2CON), 2, b
#define DAC2PSS1                         BANKMASK(DAC2CON), 3, b
#define DAC2R0                           BANKMASK(DAC2DATL), 0, b
#define DAC2R1                           BANKMASK(DAC2DATL), 1, b
#define DAC2R2                           BANKMASK(DAC2DATL), 2, b
#define DAC2R3                           BANKMASK(DAC2DATL), 3, b
#define DAC2R4                           BANKMASK(DAC2DATL), 4, b
#define DAC2R5                           BANKMASK(DAC2DATL), 5, b
#define DAC2R6                           BANKMASK(DAC2DATL), 6, b
#define DAC2R7                           BANKMASK(DAC2DATL), 7, b
#define DAC3EN                           BANKMASK(DAC3CON), 7, b
#define DAC3MD                           BANKMASK(PMD6), 2, b
#define DAC3PSS0                         BANKMASK(DAC3CON), 2, b
#define DAC3PSS1                         BANKMASK(DAC3CON), 3, b
#define DAC3R0                           BANKMASK(DAC3DATL), 0, b
#define DAC3R1                           BANKMASK(DAC3DATL), 1, b
#define DAC3R2                           BANKMASK(DAC3DATL), 2, b
#define DAC3R3                           BANKMASK(DAC3DATL), 3, b
#define DAC3R4                           BANKMASK(DAC3DATL), 4, b
#define DAC3R5                           BANKMASK(DAC3DATL), 5, b
#define DAC3R6                           BANKMASK(DAC3DATL), 6, b
#define DAC3R7                           BANKMASK(DAC3DATL), 7, b
#define DATA                             BANKMASK(I2C1STAT0), 3, b
#define DATA0                            BANKMASK(CRCDATAL), 0, b
#define DATA1                            BANKMASK(CRCDATAL), 1, b
#define DATA10                           BANKMASK(CRCDATAH), 2, b
#define DATA11                           BANKMASK(CRCDATAH), 3, b
#define DATA12                           BANKMASK(CRCDATAH), 4, b
#define DATA13                           BANKMASK(CRCDATAH), 5, b
#define DATA14                           BANKMASK(CRCDATAH), 6, b
#define DATA15                           BANKMASK(CRCDATAH), 7, b
#define DATA16                           BANKMASK(CRCDATAU), 0, b
#define DATA17                           BANKMASK(CRCDATAU), 1, b
#define DATA18                           BANKMASK(CRCDATAU), 2, b
#define DATA19                           BANKMASK(CRCDATAU), 3, b
#define DATA2                            BANKMASK(CRCDATAL), 2, b
#define DATA20                           BANKMASK(CRCDATAU), 4, b
#define DATA21                           BANKMASK(CRCDATAU), 5, b
#define DATA22                           BANKMASK(CRCDATAU), 6, b
#define DATA23                           BANKMASK(CRCDATAU), 7, b
#define DATA24                           BANKMASK(CRCDATAT), 0, b
#define DATA25                           BANKMASK(CRCDATAT), 1, b
#define DATA26                           BANKMASK(CRCDATAT), 2, b
#define DATA27                           BANKMASK(CRCDATAT), 3, b
#define DATA28                           BANKMASK(CRCDATAT), 4, b
#define DATA29                           BANKMASK(CRCDATAT), 5, b
#define DATA3                            BANKMASK(CRCDATAL), 3, b
#define DATA30                           BANKMASK(CRCDATAT), 6, b
#define DATA31                           BANKMASK(CRCDATAT), 7, b
#define DATA4                            BANKMASK(CRCDATAL), 4, b
#define DATA5                            BANKMASK(CRCDATAL), 5, b
#define DATA6                            BANKMASK(CRCDATAL), 6, b
#define DATA7                            BANKMASK(CRCDATAL), 7, b
#define DATA8                            BANKMASK(CRCDATAH), 0, b
#define DATA9                            BANKMASK(CRCDATAH), 1, b
#define DBF0                             BANKMASK(CWG1DBF), 0, b
#define DBF1                             BANKMASK(CWG1DBF), 1, b
#define DBF2                             BANKMASK(CWG1DBF), 2, b
#define DBF3                             BANKMASK(CWG1DBF), 3, b
#define DBF4                             BANKMASK(CWG1DBF), 4, b
#define DBF5                             BANKMASK(CWG1DBF), 5, b
#define DBR0                             BANKMASK(CWG1DBR), 0, b
#define DBR1                             BANKMASK(CWG1DBR), 1, b
#define DBR2                             BANKMASK(CWG1DBR), 2, b
#define DBR3                             BANKMASK(CWG1DBR), 3, b
#define DBR4                             BANKMASK(CWG1DBR), 4, b
#define DBR5                             BANKMASK(CWG1DBR), 5, b
#define DC0                              BANKMASK(CLKRCON), 3, b
#define DC1                              BANKMASK(CLKRCON), 4, b
#define DCNT0                            BANKMASK(DMAnDCNTL), 0, b
#define DCNT1                            BANKMASK(DMAnDCNTL), 1, b
#define DCNT10                           BANKMASK(DMAnDCNTH), 2, b
#define DCNT11                           BANKMASK(DMAnDCNTH), 3, b
#define DCNT2                            BANKMASK(DMAnDCNTL), 2, b
#define DCNT3                            BANKMASK(DMAnDCNTL), 3, b
#define DCNT4                            BANKMASK(DMAnDCNTL), 4, b
#define DCNT5                            BANKMASK(DMAnDCNTL), 5, b
#define DCNT6                            BANKMASK(DMAnDCNTL), 6, b
#define DCNT7                            BANKMASK(DMAnDCNTL), 7, b
#define DCNT8                            BANKMASK(DMAnDCNTH), 0, b
#define DCNT9                            BANKMASK(DMAnDCNTH), 1, b
#define DF0                              BANKMASK(PORTWDF), 0, b
#define DF1                              BANKMASK(PORTWDF), 1, b
#define DF2                              BANKMASK(PORTWDF), 2, b
#define DF3                              BANKMASK(PORTWDF), 3, b
#define DF4                              BANKMASK(PORTWDF), 4, b
#define DF5                              BANKMASK(PORTWDF), 5, b
#define DF6                              BANKMASK(PORTWDF), 6, b
#define DF7                              BANKMASK(PORTWDF), 7, b
#define DGO                              BANKMASK(DMAnCON0), 5, b
#define DIV0                             BANKMASK(CLKRCON), 0, b
#define DIV1                             BANKMASK(CLKRCON), 1, b
#define DIV2                             BANKMASK(CLKRCON), 2, b
#define DLEN0                            BANKMASK(CRCCON2), 0, b
#define DLEN1                            BANKMASK(CRCCON2), 1, b
#define DLEN2                            BANKMASK(CRCCON2), 2, b
#define DLEN3                            BANKMASK(CRCCON2), 3, b
#define DLEN4                            BANKMASK(CRCCON2), 4, b
#define DMA1AIE                          BANKMASK(PIE2), 7, a
#define DMA1AIF                          BANKMASK(PIR2), 7, a
#define DMA1AIP                          BANKMASK(IPR2), 7, a
#define DMA1DCNTIE                       BANKMASK(PIE2), 5, a
#define DMA1DCNTIF                       BANKMASK(PIR2), 5, a
#define DMA1DCNTIP                       BANKMASK(IPR2), 5, a
#define DMA1MD                           BANKMASK(PMD4), 5, b
#define DMA1ORIE                         BANKMASK(PIE2), 6, a
#define DMA1ORIF                         BANKMASK(PIR2), 6, a
#define DMA1ORIP                         BANKMASK(IPR2), 6, a
#define DMA1PR0                          BANKMASK(DMA1PR), 0, b
#define DMA1PR1                          BANKMASK(DMA1PR), 1, b
#define DMA1PR2                          BANKMASK(DMA1PR), 2, b
#define DMA1SCNTIE                       BANKMASK(PIE2), 4, a
#define DMA1SCNTIF                       BANKMASK(PIR2), 4, a
#define DMA1SCNTIP                       BANKMASK(IPR2), 4, a
#define DMA2AIE                          BANKMASK(PIE6), 7, a
#define DMA2AIF                          BANKMASK(PIR6), 7, a
#define DMA2AIP                          BANKMASK(IPR6), 7, a
