GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.inc
#define TU16BPRH7                        BANKMASK(TU16BPRH), 7, b
#define TU16BPRIE                        BANKMASK(TU16BCON0), 2, b
#define TU16BPRIF                        BANKMASK(TU16BCON1), 2, b
#define TU16BPRL0                        BANKMASK(TU16BPRL), 0, b
#define TU16BPRL1                        BANKMASK(TU16BPRL), 1, b
#define TU16BPRL2                        BANKMASK(TU16BPRL), 2, b
#define TU16BPRL3                        BANKMASK(TU16BPRL), 3, b
#define TU16BPRL4                        BANKMASK(TU16BPRL), 4, b
#define TU16BPRL5                        BANKMASK(TU16BPRL), 5, b
#define TU16BPRL6                        BANKMASK(TU16BPRL), 6, b
#define TU16BPRL7                        BANKMASK(TU16BPRL), 7, b
#define TU16BPS0                         BANKMASK(TU16BPS), 0, b
#define TU16BPS1                         BANKMASK(TU16BPS), 1, b
#define TU16BPS2                         BANKMASK(TU16BPS), 2, b
#define TU16BPS3                         BANKMASK(TU16BPS), 3, b
#define TU16BPS4                         BANKMASK(TU16BPS), 4, b
#define TU16BPS5                         BANKMASK(TU16BPS), 5, b
#define TU16BPS6                         BANKMASK(TU16BPS), 6, b
#define TU16BPS7                         BANKMASK(TU16BPS), 7, b
#define TU16BRDSEL                       BANKMASK(TU16BCON0), 3, b
#define TU16BRESET0                      BANKMASK(TU16BHLT), 2, b
#define TU16BRESET1                      BANKMASK(TU16BHLT), 3, b
#define TU16BRUN                         BANKMASK(TU16BCON1), 7, b
#define TU16BSTART0                      BANKMASK(TU16BHLT), 4, b
#define TU16BSTART1                      BANKMASK(TU16BHLT), 5, b
#define TU16BSTOP0                       BANKMASK(TU16BHLT), 0, b
#define TU16BSTOP1                       BANKMASK(TU16BHLT), 1, b
#define TU16BTMR0                        BANKMASK(TU16BTMRL), 0, b
#define TU16BTMR1                        BANKMASK(TU16BTMRL), 1, b
#define TU16BTMR10                       BANKMASK(TU16BTMRH), 2, b
#define TU16BTMR11                       BANKMASK(TU16BTMRH), 3, b
#define TU16BTMR12                       BANKMASK(TU16BTMRH), 4, b
#define TU16BTMR13                       BANKMASK(TU16BTMRH), 5, b
#define TU16BTMR14                       BANKMASK(TU16BTMRH), 6, b
#define TU16BTMR15                       BANKMASK(TU16BTMRH), 7, b
#define TU16BTMR2                        BANKMASK(TU16BTMRL), 2, b
#define TU16BTMR3                        BANKMASK(TU16BTMRL), 3, b
#define TU16BTMR4                        BANKMASK(TU16BTMRL), 4, b
#define TU16BTMR5                        BANKMASK(TU16BTMRL), 5, b
#define TU16BTMR6                        BANKMASK(TU16BTMRL), 6, b
#define TU16BTMR7                        BANKMASK(TU16BTMRL), 7, b
#define TU16BTMR8                        BANKMASK(TU16BTMRH), 0, b
#define TU16BTMR9                        BANKMASK(TU16BTMRH), 1, b
#define TU16BTMRH0                       BANKMASK(TU16BTMRH), 0, b
#define TU16BTMRH1                       BANKMASK(TU16BTMRH), 1, b
#define TU16BTMRH2                       BANKMASK(TU16BTMRH), 2, b
#define TU16BTMRH3                       BANKMASK(TU16BTMRH), 3, b
#define TU16BTMRH4                       BANKMASK(TU16BTMRH), 4, b
#define TU16BTMRH5                       BANKMASK(TU16BTMRH), 5, b
#define TU16BTMRH6                       BANKMASK(TU16BTMRH), 6, b
#define TU16BTMRH7                       BANKMASK(TU16BTMRH), 7, b
#define TU16BTMRL0                       BANKMASK(TU16BTMRL), 0, b
#define TU16BTMRL1                       BANKMASK(TU16BTMRL), 1, b
#define TU16BTMRL2                       BANKMASK(TU16BTMRL), 2, b
#define TU16BTMRL3                       BANKMASK(TU16BTMRL), 3, b
#define TU16BTMRL4                       BANKMASK(TU16BTMRL), 4, b
#define TU16BTMRL5                       BANKMASK(TU16BTMRL), 5, b
#define TU16BTMRL6                       BANKMASK(TU16BTMRL), 6, b
#define TU16BTMRL7                       BANKMASK(TU16BTMRL), 7, b
#define TU16BZIE                         BANKMASK(TU16BCON0), 1, b
#define TU16BZIF                         BANKMASK(TU16BCON1), 1, b
#define TU1MD                            BANKMASK(PMD6), 0, b
#define TU2MD                            BANKMASK(PMD6), 1, b
#define TUIN0PPS0                        BANKMASK(TUIN0PPS), 0, b
#define TUIN0PPS1                        BANKMASK(TUIN0PPS), 1, b
#define TUIN0PPS2                        BANKMASK(TUIN0PPS), 2, b
#define TUIN0PPS3                        BANKMASK(TUIN0PPS), 3, b
#define TUIN0PPS4                        BANKMASK(TUIN0PPS), 4, b
#define TUIN0PPS5                        BANKMASK(TUIN0PPS), 5, b
#define TUIN1PPS0                        BANKMASK(TUIN1PPS), 0, b
#define TUIN1PPS1                        BANKMASK(TUIN1PPS), 1, b
#define TUIN1PPS2                        BANKMASK(TUIN1PPS), 2, b
#define TUIN1PPS3                        BANKMASK(TUIN1PPS), 3, b
#define TUIN1PPS4                        BANKMASK(TUIN1PPS), 4, b
#define TUIN1PPS5                        BANKMASK(TUIN1PPS), 5, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TWIDTH0                          BANKMASK(SPI1TWIDTH), 0, b
#define TWIDTH1                          BANKMASK(SPI1TWIDTH), 1, b
#define TWIDTH2                          BANKMASK(SPI1TWIDTH), 2, b
#define TXB0                             BANKMASK(SPI1TXB), 0, b
#define TXB1                             BANKMASK(SPI1TXB), 1, b
#define TXB2                             BANKMASK(SPI1TXB), 2, b
#define TXB3                             BANKMASK(SPI1TXB), 3, b
#define TXB4                             BANKMASK(SPI1TXB), 4, b
#define TXB5                             BANKMASK(SPI1TXB), 5, b
#define TXB6                             BANKMASK(SPI1TXB), 6, b
#define TXB7                             BANKMASK(SPI1TXB), 7, b
#define TXR                              BANKMASK(SPI1CON2), 1, b
#define TXU                              BANKMASK(I2C1CON1), 1, b
#define TXUIE                            BANKMASK(SPI1INTE), 1, b
#define TXUIF                            BANKMASK(SPI1INTF), 1, b
#define U1ABDEN                          BANKMASK(U1CON0), 6, b
#define U1ABDIE                          BANKMASK(U1UIR), 2, b
#define U1ABDIF                          BANKMASK(U1UIR), 6, b
#define U1ABDOVE                         BANKMASK(U1ERRIE), 5, b
#define U1ABDOVF                         BANKMASK(U1ERRIR), 5, b
#define U1BRGS                           BANKMASK(U1CON0), 7, b
#define U1BRKOVR                         BANKMASK(U1CON1), 1, b
#define U1C0EN                           BANKMASK(U1CON2), 3, b
#define U1CERIE                          BANKMASK(U1ERRIE), 4, b
#define U1CERIF                          BANKMASK(U1ERRIR), 4, b
#define U1CTSPPS0                        BANKMASK(U1CTSPPS), 0, b
#define U1CTSPPS1                        BANKMASK(U1CTSPPS), 1, b
#define U1CTSPPS2                        BANKMASK(U1CTSPPS), 2, b
#define U1CTSPPS3                        BANKMASK(U1CTSPPS), 3, b
#define U1CTSPPS4                        BANKMASK(U1CTSPPS), 4, b
#define U1CTSPPS5                        BANKMASK(U1CTSPPS), 5, b
#define U1EIE                            BANKMASK(PIE4), 2, a
#define U1EIF                            BANKMASK(PIR4), 2, a
#define U1EIP                            BANKMASK(IPR4), 2, a
#define U1FERIE                          BANKMASK(U1ERRIE), 3, b
#define U1FERIF                          BANKMASK(U1ERRIR), 3, b
#define U1FLO0                           BANKMASK(U1CON2), 0, b
#define U1FLO1                           BANKMASK(U1CON2), 1, b
#define U1IE                             BANKMASK(PIE4), 3, a
#define U1IF                             BANKMASK(PIR4), 3, a
#define U1IP                             BANKMASK(IPR4), 3, a
#define U1MD                             BANKMASK(PMD3), 6, b
#define U1MODE0                          BANKMASK(U1CON0), 0, b
#define U1MODE1                          BANKMASK(U1CON0), 1, b
#define U1MODE2                          BANKMASK(U1CON0), 2, b
#define U1MODE3                          BANKMASK(U1CON0), 3, b
#define U1ON                             BANKMASK(U1CON1), 7, b
#define U1PERIE                          BANKMASK(U1ERRIE), 6, b
#define U1PERIF                          BANKMASK(U1ERRIR), 6, b
#define U1RCIDL                          BANKMASK(U1FIFO), 3, b
#define U1RUNOVF                         BANKMASK(U1CON2), 7, b
#define U1RXBE                           BANKMASK(U1FIFO), 1, b
#define U1RXBF                           BANKMASK(U1FIFO), 0, b
#define U1RXBIMD                         BANKMASK(U1CON1), 3, b
#define U1RXBKIE                         BANKMASK(U1ERRIE), 2, b
#define U1RXBKIF                         BANKMASK(U1ERRIR), 2, b
#define U1RXEN                           BANKMASK(U1CON0), 4, b
#define U1RXFOIE                         BANKMASK(U1ERRIE), 1, b
#define U1RXFOIF                         BANKMASK(U1ERRIR), 1, b
#define U1RXIDL                          BANKMASK(U1FIFO), 3, b
#define U1RXIE                           BANKMASK(PIE4), 0, a
#define U1RXIF                           BANKMASK(PIR4), 0, a
#define U1RXIP                           BANKMASK(IPR4), 0, a
#define U1RXPOL                          BANKMASK(U1CON2), 6, b
#define U1RXPPS0                         BANKMASK(U1RXPPS), 0, b
#define U1RXPPS1                         BANKMASK(U1RXPPS), 1, b
#define U1RXPPS2                         BANKMASK(U1RXPPS), 2, b
#define U1RXPPS3                         BANKMASK(U1RXPPS), 3, b
#define U1RXPPS4                         BANKMASK(U1RXPPS), 4, b
#define U1RXPPS5                         BANKMASK(U1RXPPS), 5, b
#define U1SENDB                          BANKMASK(U1CON1), 0, b
#define U1STP0                           BANKMASK(U1CON2), 4, b
#define U1STP1                           BANKMASK(U1CON2), 5, b
#define U1STPMD                          BANKMASK(U1FIFO), 6, b
#define U1TXBE                           BANKMASK(U1FIFO), 5, b
#define U1TXBF                           BANKMASK(U1FIFO), 4, b
#define U1TXCIE                          BANKMASK(U1ERRIE), 0, b
#define U1TXCIF                          BANKMASK(U1ERRIR), 0, b
#define U1TXEN                           BANKMASK(U1CON0), 5, b
#define U1TXIE                           BANKMASK(PIE4), 1, a
#define U1TXIF                           BANKMASK(PIR4), 1, a
#define U1TXIP                           BANKMASK(IPR4), 1, a
#define U1TXMTIE                         BANKMASK(U1ERRIE), 7, b
#define U1TXMTIF                         BANKMASK(U1ERRIR), 7, b
#define U1TXPOL                          BANKMASK(U1CON2), 2, b
#define U1TXWRE                          BANKMASK(U1FIFO), 7, b
#define U1WUE                            BANKMASK(U1CON1), 4, b
#define U1WUIF                           BANKMASK(U1UIR), 7, b
#define U1XON                            BANKMASK(U1FIFO), 2, b
#define U2ABDEN                          BANKMASK(U2CON0), 6, b
#define U2ABDIE                          BANKMASK(U2UIR), 2, b
#define U2ABDIF                          BANKMASK(U2UIR), 6, b
#define U2ABDOVE                         BANKMASK(U2ERRIE), 5, b
#define U2ABDOVF                         BANKMASK(U2ERRIR), 5, b
#define U2BRGS                           BANKMASK(U2CON0), 7, b
#define U2BRKOVR                         BANKMASK(U2CON1), 1, b
#define U2CERIE                          BANKMASK(U2ERRIE), 4, b
#define U2CERIF                          BANKMASK(U2ERRIR), 4, b
#define U2CTSPPS0                        BANKMASK(U2CTSPPS), 0, b
#define U2CTSPPS1                        BANKMASK(U2CTSPPS), 1, b
#define U2CTSPPS2                        BANKMASK(U2CTSPPS), 2, b
#define U2CTSPPS3                        BANKMASK(U2CTSPPS), 3, b
#define U2CTSPPS4                        BANKMASK(U2CTSPPS), 4, b
#define U2CTSPPS5                        BANKMASK(U2CTSPPS), 5, b
#define U2EIE                            BANKMASK(PIE8), 2, a
#define U2EIF                            BANKMASK(PIR8), 2, a
#define U2EIP                            BANKMASK(IPR8), 2, a
#define U2FERIE                          BANKMASK(U2ERRIE), 3, b
#define U2FERIF                          BANKMASK(U2ERRIR), 3, b
#define U2FLO0                           BANKMASK(U2CON2), 0, b
#define U2FLO1                           BANKMASK(U2CON2), 1, b
#define U2IE                             BANKMASK(PIE8), 3, a
#define U2IF                             BANKMASK(PIR8), 3, a
#define U2IP                             BANKMASK(IPR8), 3, a
#define U2MD                             BANKMASK(PMD3), 7, b
#define U2MODE0                          BANKMASK(U2CON0), 0, b
#define U2MODE1                          BANKMASK(U2CON0), 1, b
#define U2MODE2                          BANKMASK(U2CON0), 2, b
#define U2MODE3                          BANKMASK(U2CON0), 3, b
#define U2ON                             BANKMASK(U2CON1), 7, b
#define U2PERIE                          BANKMASK(U2ERRIE), 6, b
#define U2PERIF                          BANKMASK(U2ERRIR), 6, b
#define U2RCIDL                          BANKMASK(U2FIFO), 3, b
#define U2RUNOVF                         BANKMASK(U2CON2), 7, b
#define U2RXBE                           BANKMASK(U2FIFO), 1, b
#define U2RXBF                           BANKMASK(U2FIFO), 0, b
#define U2RXBIMD                         BANKMASK(U2CON1), 3, b
#define U2RXBKIE                         BANKMASK(U2ERRIE), 2, b
#define U2RXBKIF                         BANKMASK(U2ERRIR), 2, b
#define U2RXEN                           BANKMASK(U2CON0), 4, b
#define U2RXFOIE                         BANKMASK(U2ERRIE), 1, b
#define U2RXFOIF                         BANKMASK(U2ERRIR), 1, b
#define U2RXIDL                          BANKMASK(U2FIFO), 3, b
#define U2RXIE                           BANKMASK(PIE8), 0, a
#define U2RXIF                           BANKMASK(PIR8), 0, a
#define U2RXIP                           BANKMASK(IPR8), 0, a
#define U2RXPOL                          BANKMASK(U2CON2), 6, b
#define U2RXPPS0                         BANKMASK(U2RXPPS), 0, b
#define U2RXPPS1                         BANKMASK(U2RXPPS), 1, b
#define U2RXPPS2                         BANKMASK(U2RXPPS), 2, b
#define U2RXPPS3                         BANKMASK(U2RXPPS), 3, b
#define U2RXPPS4                         BANKMASK(U2RXPPS), 4, b
#define U2RXPPS5                         BANKMASK(U2RXPPS), 5, b
#define U2SENDB                          BANKMASK(U2CON1), 0, b
#define U2STP0                           BANKMASK(U2CON2), 4, b
#define U2STP1                           BANKMASK(U2CON2), 5, b
#define U2STPMD                          BANKMASK(U2FIFO), 6, b
#define U2TXBE                           BANKMASK(U2FIFO), 5, b
#define U2TXBF                           BANKMASK(U2FIFO), 4, b
#define U2TXCIE                          BANKMASK(U2ERRIE), 0, b
#define U2TXCIF                          BANKMASK(U2ERRIR), 0, b
#define U2TXEN                           BANKMASK(U2CON0), 5, b
#define U2TXIE                           BANKMASK(PIE8), 1, a
#define U2TXIF                           BANKMASK(PIR8), 1, a
#define U2TXIP                           BANKMASK(IPR8), 1, a
#define U2TXMTIE                         BANKMASK(U2ERRIE), 7, b
#define U2TXMTIF                         BANKMASK(U2ERRIR), 7, b
#define U2TXPOL                          BANKMASK(U2CON2), 2, b
#define U2TXWRE                          BANKMASK(U2FIFO), 7, b
#define U2WUE                            BANKMASK(U2CON1), 4, b
#define U2WUIF                           BANKMASK(U2UIR), 7, b
#define U2XON                            BANKMASK(U2FIFO), 2, b
#define UD                               BANKMASK(ACTCON), 6, b
#define UTH0                             BANKMASK(ADUTHL), 0, b
#define UTH1                             BANKMASK(ADUTHL), 1, b
#define UTH10                            BANKMASK(ADUTHH), 2, b
#define UTH11                            BANKMASK(ADUTHH), 3, b
#define UTH12                            BANKMASK(ADUTHH), 4, b
#define UTH13                            BANKMASK(ADUTHH), 5, b
#define UTH14                            BANKMASK(ADUTHH), 6, b
#define UTH15                            BANKMASK(ADUTHH), 7, b
#define UTH2                             BANKMASK(ADUTHL), 2, b
#define UTH3                             BANKMASK(ADUTHL), 3, b
#define UTH4                             BANKMASK(ADUTHL), 4, b
#define UTH5                             BANKMASK(ADUTHL), 5, b
#define UTH6                             BANKMASK(ADUTHL), 6, b
#define UTH7                             BANKMASK(ADUTHL), 7, b
#define UTH8                             BANKMASK(ADUTHH), 0, b
#define UTH9                             BANKMASK(ADUTHH), 1, b
#define UTHR                             BANKMASK(ADSTAT), 6, b
#define VPORTMD                          BANKMASK(PMD6), 3, b
#define VREGPM0                          BANKMASK(VREGCON), 0, b
#define VREGPM1                          BANKMASK(VREGCON), 1, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUD0                            BANKMASK(WPUD), 0, b
#define WPUD1                            BANKMASK(WPUD), 1, b
#define WPUD2                            BANKMASK(WPUD), 2, b
#define WPUD3                            BANKMASK(WPUD), 3, b
#define WPUD4                            BANKMASK(WPUD), 4, b
#define WPUD5                            BANKMASK(WPUD), 5, b
#define WPUD6                            BANKMASK(WPUD), 6, b
#define WPUD7                            BANKMASK(WPUD), 7, b
#define WPUE0                            BANKMASK(WPUE), 0, b
#define WPUE1                            BANKMASK(WPUE), 1, b
#define WPUE2                            BANKMASK(WPUE), 2, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WRERR                            BANKMASK(NVMCON1), 7, b
#define WRIE                             BANKMASK(I2C1PIE), 4, b
#define WRIF                             BANKMASK(I2C1PIR), 4, b
#define XIP                              BANKMASK(DMAnCON0), 0, b
#define XOR0                             BANKMASK(CRCXORL), 0, b
#define XOR1                             BANKMASK(CRCXORL), 1, b
#define XOR10                            BANKMASK(CRCXORH), 2, b
#define XOR11                            BANKMASK(CRCXORH), 3, b
#define XOR12                            BANKMASK(CRCXORH), 4, b
#define XOR13                            BANKMASK(CRCXORH), 5, b
#define XOR14                            BANKMASK(CRCXORH), 6, b
#define XOR15                            BANKMASK(CRCXORH), 7, b
#define XOR16                            BANKMASK(CRCXORU), 0, b
#define XOR17                            BANKMASK(CRCXORU), 1, b
#define XOR18                            BANKMASK(CRCXORU), 2, b
#define XOR19                            BANKMASK(CRCXORU), 3, b
#define XOR2                             BANKMASK(CRCXORL), 2, b
#define XOR20                            BANKMASK(CRCXORU), 4, b
#define XOR21                            BANKMASK(CRCXORU), 5, b
#define XOR22                            BANKMASK(CRCXORU), 6, b
#define XOR23                            BANKMASK(CRCXORU), 7, b
#define XOR24                            BANKMASK(CRCXORT), 0, b
#define XOR25                            BANKMASK(CRCXORT), 1, b
#define XOR26                            BANKMASK(CRCXORT), 2, b
#define XOR27                            BANKMASK(CRCXORT), 3, b
#define XOR28                            BANKMASK(CRCXORT), 4, b
#define XOR29                            BANKMASK(CRCXORT), 5, b
#define XOR3                             BANKMASK(CRCXORL), 3, b
#define XOR30                            BANKMASK(CRCXORT), 6, b
#define XOR31                            BANKMASK(CRCXORT), 7, b
#define XOR4                             BANKMASK(CRCXORL), 4, b
#define XOR5                             BANKMASK(CRCXORL), 5, b
#define XOR6                             BANKMASK(CRCXORL), 6, b
#define XOR7                             BANKMASK(CRCXORL), 7, b
#define XOR8                             BANKMASK(CRCXORH), 0, b
#define XOR9                             BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE2), 0, a
#define ZCDIF                            BANKMASK(PIR2), 0, a
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR2), 0, a
#define ZCDMD                            BANKMASK(PMD1), 6, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define nBOR                             BANKMASK(PCON0), 0, a
