GopalSaraf/Practicals/PSDL/include/proc/pic18f46q71.inc
#define nDONE                            BANKMASK(NVMCON0), 0, b
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRCM                             BANKMASK(PCON1), 0, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRVREG                           BANKMASK(PCON1), 2, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank5,class=BANK5,space=SPACE_DATA,noexec,lowdata
psect udata_bank6,class=BANK6,space=SPACE_DATA,noexec,lowdata
psect udata_bank7,class=BANK7,space=SPACE_DATA,noexec,lowdata
psect udata_bank8,class=BANK8,space=SPACE_DATA,noexec,lowdata
psect udata_bank9,class=BANK9,space=SPACE_DATA,noexec,lowdata
psect udata_bank10,class=BANK10,space=SPACE_DATA,noexec,lowdata
psect udata_bank11,class=BANK11,space=SPACE_DATA,noexec,lowdata
psect udata_bank12,class=BANK12,space=SPACE_DATA,noexec,lowdata
psect udata_bank13,class=BANK13,space=SPACE_DATA,noexec,lowdata
psect udata_bank14,class=BANK14,space=SPACE_DATA,noexec,lowdata
psect udata_bank15,class=BANK15,space=SPACE_DATA,noexec,lowdata
psect udata_bank16,class=BANK16,space=SPACE_DATA,noexec
psect udata_bank17,class=BANK17,space=SPACE_DATA,noexec
psect udata_bank18,class=BANK18,space=SPACE_DATA,noexec
psect udata_bank19,class=BANK19,space=SPACE_DATA,noexec
psect udata_bank20,class=BANK20,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18F46Q71_INC_
